xmlcf/DataProcessors/ГлавнаяСтраница.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>ГлавнаяСтраница</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Портфель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Портфель</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

xmlcf/AccumulationRegisters/АктивыОстатки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>АктивыОстатки</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СуммаАктива</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Актив</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Активы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюта</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Портфель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Портфель</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

xmlcf/DataProcessors/ГлавнаяСтраница/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПортфельПриИзмененииНаСервере();
	
	//ПодключитьОбработчикОжидания("ПолучитьТаблицуТекущихЦен", 30);
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьТаблицуТекущихЦен()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АктивыОстатки.Актив КАК Актив
		|ИЗ
		|	РегистрНакопления.АктивыОстатки КАК АктивыОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	АктивыОстатки.Актив";
	
	МассивАктивов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Актив");
	ТаблицаТекущихЦен.Загрузить(ИнтеграцияСТинькоффПоAPIСервер.ПолучитьТекущиеЦеныАктивов(МассивАктивов));
	
	СписокАктивы.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("ТаблицаТекущихЦен",ТаблицаТекущихЦен);
	
	Элементы.СписокАктивы.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура ПортфельПриИзмененииНаСервере()

	Если ЗначениеЗаполнено(Объект.Портфель) тогда
		СписокАктивы.Параметры.УстановитьЗначениеПараметра("Портфель", Объект.Портфель);
	Иначе
		СписокАктивы.Параметры.УстановитьЗначениеПараметра("Портфель",Неопределено);	
	КонецЕсли;
	
	ПолучитьТаблицуТекущихЦен();
	
КонецПроцедуры

&НаКлиенте
Процедура ПортфельПриИзменении(Элемент)
	ПортфельПриИзмененииНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокАктивыПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	//ТаблицаЦен = Новый ТаблицаЗначений;
	//Настройки.ДополнительныеСвойства.Свойство("ТаблицаТекущихЦен",ТаблицаЦен);
	//
	//ДанныеФормыВЗначение("ТаблицаЦен", Тип("ТаблицаЗначений"));
	//
	//Для каждого СтрокаСписка из Строки цикл
	//	СтрокаТекущейЦены = ТаблицаЦен.Найти(СтрокаСписка.Ключ, "Актив");
	//	СтрокаСписка.Значение.Данные.ТекущаяСтоимость = "";
	//	а = 1;
	//	
	//КонецЦикла;
	
КонецПроцедуры
